BornaBiro/ESP32_WeatherPaper/Arduino Code/Libraries/RF24_Inkplate/RF24_Inkplate.cpp
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>

 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */

#include "nRF24L01.h"
#include "RF24_config.h"
#include "RF24_Inkplate.h"


/****************************************************************************/

void RF24_Inkplate::csn(bool mode)
{
    //_SPI->setBitOrder(MSBFIRST);
    //_SPI->setDataMode(SPI_MODE0);
    //_SPI.setClockDivider(SPI_CLOCK_DIV2);

    _ink->digitalWriteInternal(MCP23017_INT_ADDR, _ink->mcpRegsInt, 14, mode);
    delayMicroseconds(csDelay);
}

/****************************************************************************/

void RF24_Inkplate::ce(bool level)
{
    _ink->digitalWriteInternal(MCP23017_INT_ADDR, _ink->mcpRegsInt, 15, level);
}

/****************************************************************************/

inline void RF24_Inkplate::beginTransaction()
{
    _SPI->beginTransaction(SPISettings(spi_speed, MSBFIRST, SPI_MODE0));
    csn(LOW);
}

/****************************************************************************/

inline void RF24_Inkplate::endTransaction()
{
    _SPI->endTransaction();
    csn(HIGH);
}

/****************************************************************************/

void RF24_Inkplate::read_register(uint8_t reg, uint8_t* buf, uint8_t len)
{
    beginTransaction();
    status = _SPI->transfer(R_REGISTER | reg);
    while (len--) {
        *buf++ = _SPI->transfer(0xFF);
    }
    endTransaction();
}

/****************************************************************************/

uint8_t RF24_Inkplate::read_register(uint8_t reg)
{
    uint8_t result;

    beginTransaction();
    status = _SPI->transfer(R_REGISTER | reg);
    result = _SPI->transfer(0xff);
    endTransaction();

    return result;
}

/****************************************************************************/

void RF24_Inkplate::write_register(uint8_t reg, const uint8_t* buf, uint8_t len)
{
    beginTransaction();
    status = _SPI->transfer(W_REGISTER | reg);
    while (len--) {
        _SPI->transfer(*buf++);
    }
    endTransaction();
}

/****************************************************************************/

void RF24_Inkplate::write_register(uint8_t reg, uint8_t value, bool is_cmd_only)
{
    if (is_cmd_only) {
        beginTransaction();
        status = _SPI->transfer(W_REGISTER | reg);
        endTransaction();
    }
    else {
        beginTransaction();
        status = _SPI->transfer(W_REGISTER | reg);
        _SPI->transfer(value);
        endTransaction();
    }
}

/****************************************************************************/

void RF24_Inkplate::write_payload(const void* buf, uint8_t data_len, const uint8_t writeType)
{
    const uint8_t* current = reinterpret_cast<const uint8_t*>(buf);

    uint8_t blank_len = !data_len ? 1 : 0;
    if (!dynamic_payloads_enabled) {
        data_len = rf24_min(data_len, payload_size);
        blank_len = payload_size - data_len;
    }
    else {
        data_len = rf24_min(data_len, 32);
    }

    beginTransaction();
    status = _SPI->transfer(writeType);
    while (data_len--) {
        _SPI->transfer(*current++);
    }
    while (blank_len--) {
        _SPI->transfer(0);
    }
    endTransaction();
}

/****************************************************************************/

void RF24_Inkplate::read_payload(void* buf, uint8_t data_len)
{
    uint8_t* current = reinterpret_cast<uint8_t*>(buf);

    uint8_t blank_len = 0;
    if (!dynamic_payloads_enabled) {
        data_len = rf24_min(data_len, payload_size);
        blank_len = payload_size - data_len;
    }
    else {
        data_len = rf24_min(data_len, 32);
    }

    beginTransaction();
    status = _SPI->transfer(R_RX_PAYLOAD);
    while (data_len--) {
        *current++ = _SPI->transfer(0xFF);
    }
    while (blank_len--) {
        _SPI->transfer(0xff);
    }
    endTransaction();
}

/****************************************************************************/

uint8_t RF24_Inkplate::flush_rx(void)
{
    write_register(FLUSH_RX, RF24_NOP, true);
    return status;
}

/****************************************************************************/

uint8_t RF24_Inkplate::flush_tx(void)
{
    write_register(FLUSH_TX, RF24_NOP, true);
    return status;
}

/****************************************************************************/

uint8_t RF24_Inkplate::get_status(void)
{
    write_register(RF24_NOP, RF24_NOP, true);
    return status;
}

/****************************************************************************/

RF24_Inkplate::RF24_Inkplate(uint16_t _cepin, uint16_t _cspin, uint32_t _spi_speed)
        :ce_pin(_cepin), csn_pin(_cspin),spi_speed(_spi_speed), payload_size(32), dynamic_payloads_enabled(true), addr_width(5), _is_p_variant(false),
         csDelay(5)
{
    pipe0_reading_address[0] = 0;
    if(spi_speed <= 35000){ //Handle old BCM2835 speed constants, default to RF24_SPI_SPEED
      spi_speed = RF24_SPI_SPEED;
    }
}

/****************************************************************************/

void RF24_Inkplate::setChannel(uint8_t channel)
{
    const uint8_t max_channel = 125;
    write_register(RF_CH, rf24_min(channel, max_channel));
}

uint8_t RF24_Inkplate::getChannel()
{

    return read_register(RF_CH);
}

/****************************************************************************/

void RF24_Inkplate::setPayloadSize(uint8_t size)
{
    // payload size must be in range [1, 32]
    payload_size = rf24_max(1, rf24_min(32, size));

    // write static payload size setting for all pipes
    for (uint8_t i = 0; i < 6; ++i)
        write_register(RX_PW_P0 + i, payload_size);
}

/****************************************************************************/

uint8_t RF24_Inkplate::getPayloadSize(void)
{
    return payload_size;
}

/****************************************************************************/

bool RF24_Inkplate::begin(SPIClass *s, Inkplate *i)
{
    _SPI = s;
    _ink = i;
    // Initialize pins
    if (ce_pin != csn_pin) {
      _ink->pinModeInternal(MCP23017_INT_ADDR, _ink->mcpRegsInt, ce_pin, OUTPUT);
      _ink->pinModeInternal(MCP23017_INT_ADDR, _ink->mcpRegsInt, csn_pin, OUTPUT);
    }
    _SPI->begin(14, 12, 13, 15);
    ce(LOW);
    csn(HIGH);

    // Must allow the radio time to settle else configuration bits will not necessarily stick.
    // This is actually only required following power up but some settling time also appears to
    // be required after resets too. For full coverage, we'll always assume the worst.
    // Enabling 16b CRC is by far the most obvious case if the wrong timing is used - or skipped.
    // Technically we require 4.5ms + 14us as a worst case. We'll just call it 5ms for good measure.
    // WARNING: Delay is based on P-variant whereby non-P *may* require different timing.
    delay(5);

    // Set 1500uS (minimum for 32B payload in ESB@250KBPS) timeouts, to make testing a little easier
    // WARNING: If this is ever lowered, either 250KBS mode with AA is broken or maximum packet
    // sizes must never be used. See datasheet for a more complete explanation.
    setRetries(5, 15);
    
